# [ 타이타닉 데이터 설명 ]
* 주요 feature - Pclass, Age, SibSp, Parch, Fare
* 예측 target label - Survived<br>

컬럼 정보 확인하기

* PassengerId : 승객 번호
* Survived : 생존여부(1: 생존, 0 : 사망)
* Pclass : 승선권 클래스(1 : 1st, 2 : 2nd ,3 : 3rd)
* Name : 승객 이름
* Sex : 승객 성별
* Age : 승객 나이
* SibSp : 동반한 형제자매, 배우자 수
* Patch : 동반한 부모, 자식 수
* Ticket : 티켓의 고유 넘버
* Fare : 티켓의 요금(탑승료)
* Cabin : 객실 번호
* Embarked : 승선한 항구명(C : Cherbourg, Q : Queenstown, S : Southampton)

## 1. csv 데이타 파일 읽어오기

In [1]:
import numpy as np
import pandas as pd

In [2]:
df = pd.read_csv('data/movielens-1m/train.csv', encoding = 'utf-8')
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

## 2. 데이터프레임 구조 확인

In [3]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [4]:
df.tail()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.00,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.00,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.45,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.00,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.75,NaN,Q

In [5]:
df.shape

(891, 12)

In [6]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
PassengerId    891 non-null int64
Survived       891 non-null int64
Pclass         891 non-null int64
Name           891 non-null object
Sex            891 non-null object
Age            714 non-null float64
SibSp          891 non-null int64
Parch          891 non-null int64
Ticket         891 non-null object
Fare           891 non-null float64
Cabin          204 non-null object
Embarked       889 non-null object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [7]:
df.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

In [8]:
df.columns # 칼럼 리스트

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [9]:
len(df.columns) # 칼럼 갯수

12

## 3. 데이터프레임의 전체 컬럼 및 결측값(NaN) 존재 컬럼 확인

In [10]:
df.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [11]:
df.isnull().sum() # 빈값 하나당 1 Age - NaN 177, Cabin - NaN 687 ...

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [12]:
len(df[df['Age'].isnull()])

177

In [13]:
len(df[df['Cabin'].isnull()])

687

In [14]:
len(df[df['Embarked'].isnull()])

2

##  4. 결측값(NaN) 처리하기
* 'Age' 컬럼의 결측값(NaN)을 평균값으로 대체하기
* 'Cabin' 결측값 NaN 을 공백으로 교체하기

In [15]:
df.loc[df['Age'].isnull(), 'Age'] = df['Age'].mean()

In [16]:
len(df[df['Age'].isnull()])

0

In [17]:
df.loc[df['Cabin'].isnull(), 'Cabin'] = ' '

In [18]:
len(df[df['Cabin'].isnull()])

0

## 5. 전체 생존률 구하기
* (생존자수/전체승객인원)*100

In [19]:
(df['Survived'].sum() / df['PassengerId'].count()) *100

38.38383838383838

## 6. 각 객실 등급별 분포 수 알아보기
* 객실 등급별 승객수 확인

In [20]:
pclass_count =[]

for x in df['Pclass'].unique():
    pclass_count.append([x , df.loc[df['Pclass'] ==x, 'PassengerId']])

In [21]:
for (x, y) in pclass_count :
    print('등급 :', x,', 인원 :',  y.count())

등급 : 3 , 인원 : 491
등급 : 1 , 인원 : 216
등급 : 2 , 인원 : 184

## 7. 1등칸 / 2등칸 / 3등칸 객실 승객의 생존자 수와 비율

In [22]:
survived_count=[]
for x in df['Pclass'].unique():
    survived_count.append([x , df.loc[df['Pclass'] ==x, 'Survived']])

In [23]:
survived_count

[[3, 0      0
  2      1
  4      0
  5      0
  7      0
        ..
  882    0
  884    0
  885    0
  888    0
  890    0
  Name: Survived, Length: 491, dtype: int64], [1, 1      1
  3      1
  6      0
  11     1
  23     1
        ..
  871    1
  872    0
  879    1
  887    1
  889    1
  Name: Survived, Length: 216, dtype: int64], [2, 9      1
  15     1
  17     1
  20     0
  21     1
        ..
  866    1
  874    1
  880    1
  883    0
  886    0
  Name: Survived, Length: 184, dtype: int64]]

In [24]:
for (x, y) in survived_count :
    print('등급 :', x,', 생존인원 :',  y.sum(),'. 비율 :', y.sum()/y.count()*100)

등급 : 3 , 생존인원 : 119 . 비율 : 24.236252545824847
등급 : 1 , 생존인원 : 136 . 비율 : 62.96296296296296
등급 : 2 , 생존인원 : 87 . 비율 : 47.28260869565217

## 8. 남자와 여자의 생존률 구하기

In [25]:
gender_survived_count =[]
for x in df['Sex'].unique():
    gender_survived_count.append([x, df.loc[df['Sex'] ==x, 'Survived']])

In [26]:
gender_survived_count

[['male', 0      0
  4      0
  5      0
  6      0
  7      0
        ..
  883    0
  884    0
  886    0
  889    1
  890    0
  Name: Survived, Length: 577, dtype: int64], ['female', 1      1
  2      1
  3      1
  8      1
  9      1
        ..
  880    1
  882    0
  885    0
  887    1
  888    0
  Name: Survived, Length: 314, dtype: int64]]

In [27]:
for (x, y) in gender_survived_count :
    print('성별 :', x,', 생존인원 :',  y.sum(),'. 생존비율 :', y.sum()/y.count()*100)

성별 : male , 생존인원 : 109 . 생존비율 : 18.890814558058924
성별 : female , 생존인원 : 233 . 생존비율 : 74.20382165605095

## 9. 3등칸 객실 남자 승객의 생존자 수와 비율 알아보기

In [28]:
threegradedf = df.loc[(df['Pclass'] == 3) & (df['Sex'] == 'male')]
survived = threegradedf.loc[threegradedf['Survived'] ==1, 'PassengerId'].count()
total = threegradedf['PassengerId'].count()

print('생존자수 :', survived, '생존 비율 :', survived/total*100)

생존자수 : 47 생존 비율 : 13.544668587896252

## 10. 탑승한 곳에 따른 생존률 구하기

In [29]:
df.loc[df['Embarked'].isnull(), 'Embarked'] = '탑승위치 누락'

In [30]:
enbarked_survived_count=[]
for x in df['Embarked'].unique() :
    enbarked_survived_count.append([x, df.loc[df['Embarked'] ==x, 'Survived']])

In [31]:
enbarked_survived_count

[['S', 0      0
  2      1
  3      1
  4      0
  6      0
        ..
  883    0
  884    0
  886    0
  887    1
  888    0
  Name: Survived, Length: 644, dtype: int64], ['C', 1      1
  9      1
  19     1
  26     0
  30     0
        ..
  866    1
  874    1
  875    1
  879    1
  889    1
  Name: Survived, Length: 168, dtype: int64], ['Q', 5      0
  16     0
  22     1
  28     1
  32     1
        ..
  790    0
  825    0
  828    1
  885    0
  890    0
  Name: Survived, Length: 77, dtype: int64], ['탑승위치 누락', 61     1
  829    1
  Name: Survived, dtype: int64]]

In [33]:
for (x, y) in enbarked_survived_count :
    print('탑승 :', x,', 생존인원 :',  y.sum(),'. 생존비율 :', y.sum()/y.count() *100)

탑승 : S , 생존인원 : 217 . 생존비율 : 33.69565217391305
탑승 : C , 생존인원 : 93 . 생존비율 : 55.35714285714286
탑승 : Q , 생존인원 : 30 . 생존비율 : 38.961038961038966
탑승 : 탑승위치 누락 , 생존인원 : 2 . 생존비율 : 100.0

## 총평

모든 사람 중 38%의 사람이 생존하였다.<br>
1등칸에 탑승한 승객은 216명 중 136명이 생존, 62%의 생존률을 보였고,<br>
2등칸에 탑승한 승객은 184명 중 87명이 생존, 47%의 생존률을 보였으며<br>
3등칸에 탑승한 승객은 491명 중 119명이 생존, 24%의 생존률을 보였다.<br>
<br>
1등칸의 생존률이 확연히 높았으며, 타이타닉의 A갑판, B갑판 즉 최상위층에 위치했음이 생존률의 요인이 된 듯 하다.<br>
그에반해 3등칸은 F갑판에 주로 위치해 생존률이 24%에 불과했음<br>
출처 : <link>https://ko.wikipedia.org/wiki/RMS_%ED%83%80%EC%9D%B4%ED%83%80%EB%8B%89#%EC%B8%B5%EB%B3%84_%EA%B5%AC%EC%A1%B0</link><br>

남자와 여자의 생존률이 매우 차이가 났는데<br>
남자는 18%, 여자는 74%였다.<br>
영국의 사우샘프턴에서 미국의 뉴욕으로 향하는 배라 영국인이 다수 탔고,
신사도 정신으로 여성을 보호하려는 영국인 정신으로 구명보트를 여자에게 양보한 남자가 많아 여자의 생존률이 높았다고 생각됨<br>

이러한 두가지 요인으로 인해 3등칸이며 남자인 승객은 생존 비율이 13%에 불과했다.<br>

승선한 항구명에 따라서도 생존 비율이 달랐는데,<br>
Cherbourg, Queenstown, Southampton 항구에서 승객들이 탑승했다.<br>
경로는 Southampton => Cherbourg => Queenstown 순이였고<br>
출처 : <link>https://m.blog.naver.com/PostView.nhn?blogId=geo7319&logNo=40137045318&proxyReferer=https%3A%2F%2Fwww.google.com%2F</link>
<br>
두번째, Cherbourg에서 탑승했던 승객들의 생존비율이 55%로 가장 높았다.